<!DOCTYPE html>
<html lang="fr">
	<head>
		<meta charset="utf-8" />
		<meta name="viewport" content="width=device-width, initial-scale=1" />
		<meta name="theme-color" content="#DCDCDC" />
		<!-- Primary Meta Tags -->
		<title>Portfolio - Jérémie Delécrin</title>
		<meta name="title" content="Tricycle App - Jérémie Delécrin" />
		<meta name="description" content="Portfolio: Jérémie Delécrin, développeur et designer. Consultez mes réalisations et mes compétences." />

		<!-- Open Graph / Facebook -->
		<meta property="og:type" content="website" />
		<meta property="og:url" content="https://jeremie-delecrin.netlify.app/" />
		<meta property="og:title" content="Portfolio - Jérémie Delécrin" />
		<meta property="og:description" content="Portfolio: Jérémie Delécrin, Front-End développeur. Consultez mes réalisations et mes compétences." />
		<meta property="og:image" content="img/logo-landscape.png" />

		<!-- Twitter -->
		<meta property="twitter:card" content="summary_large_image" />
		<meta property="twitter:url" content="https://jeremie-delecrin.netlify.app/" />
		<meta property="twitter:title" content="Portfolio - Jérémie Delécrin" />
		<meta property="twitter:description" content="Portfolio: Jérémie Delécrin, développeur et designer. Consultez mes réalisations et mes compétences." />
		<meta property="twitter:image" content="img/logo-landscape.png" />

		<link rel="icon" type="image/png" href="img/favicon.png" />
		<link rel="canonical" href="https://jeremie-delecrin.netlify.app/"">
		<link rel="stylesheet" type="text/css" href="style.css" />
		<link rel="stylesheet" type="text/css" href="article.css" />
		<script async defer data-website-id="81c58298-1a43-4c6e-a70a-7f260c16ebb2" src="https://analytics.app-tricycle.com/umami.js"></script>
        <link rel="preconnect" href="https://fonts.gstatic.com">
        <link href="https://fonts.googleapis.com/css2?family=Open+Sans:wght@400;600;700;800&display=swap" rel="stylesheet">
	</head>

	<body>
        <header class="article-header">
            <button class="back-home"><a href="/">Revenir sur le Portfolio</a></button>
            <p>Portfolio - Jérémie Delécrin</p>
        </header>
		<main class="article">
			<div class="article-container">
				<h1 class="article-title">Comment Tricycle App à été crée</h1>
				<div class="article-infos">
					<div class="article-date">26 avril 2021</div>
					<div class="article-author">
						<span class="article-author-label">Écrit par</span>
						<span class="article-author-name">Jérémie Delécrin</span>
					</div>
				</div>
				<div class="article-thumbnail">
					<img src="img/TriCycle/1.png" alt="" />
				</div>
				<div class="article-content">
                    <h2>Tricycle App qu'est ce que c'est ?</h2>
                    <p>C'est une application mobile fait par un groupe de 5 jeunes &eacute;tudiants Nantais venant de Ynov Campus, ayant pour but d'aider n'importe qui &agrave; trier ses produits gr&acirc;ce &agrave; son smartphone et consulter des news positives sur l'environnement pour mettre en avant les bonnes actions faites &agrave; travers le monde.</p>
                    <p>L'application dispose se pr&eacute;sente avec 3 fonctionnalti&eacute;s principales:</p>
                    <ol>
                    <li>Le <strong>scan de produit</strong>: scanner le code barre du produit et l'application vous donnera les emplacements de tri correspondant &agrave; chaque emballages</li>
                    <li>la <strong>recherche de produit</strong>: recherchez parmi les produits d&eacute;j&agrave; existant si le produit n'a pas de code barre</li>
                    <li>la <strong>consultation d'article:</strong> nous proposons des articles positifs r&eacute;dig&eacute;s par nous-m&ecirc;me sur le th&egrave;me de l'environnement qui permet de valoriser les bonnes actions.</li>
                    </ol>
                    <p>Nous avons mis en ligne l'application sur le Google Playstore et l'Appstore d'Apple qui sont les canaux de t&eacute;l&eacute;chargements les plus r&eacute;pandus, qui permettront &agrave; un grand nombre de personne de pouvoir t&eacute;l&eacute;charger l'application.</p>
                    <p><a href="https://play.google.com/store/apps/details?id=com.tricycle.app">Lien PlayStore - Tricycle App: scannez et recyclez ♻</a></p>
                    <p><a href="https://apps.apple.com/us/app/tricycleapp/id1562482886#?platform=iphone">Lien AppStore - Tricycle App</a></p>
                    <h2>Les objectifs</h2>
                    <p>Nous nous sommes fix&eacute;s des objectifs pour l'ann&eacute;e 2020 et l'ann&eacute;e 2021, nous permettant de fix&eacute;s les points importants du projet et mesurer notre avancement.</p>
                    <p>Nous avions comme objectif de:</p>
                    <ul>
                    <li>Cr&eacute;er le <strong>syst&egrave;me de scan</strong> des code barre des produits et d'<strong>affichage des emplacements de tri</strong> selon leurs emballages</li>
                    <li>La <strong>recherche de produit</strong> gr&acirc;ce &agrave; leur nom ou leurs appartenance &agrave; une cat&eacute;gorie</li>
                    <li>Cr&eacute;ation des <strong>profils</strong> permettant de garder un historique des produits scann&eacute;es</li>
                    <li>Mettre en place le <strong>syst&egrave;me de points,</strong> selon le produit on peut recevoir plus ou moins de points et en les accumulant on peut passer des niveaux et r&eacute;cup&eacute;rer des r&eacute;compenses.</li>
                    <li>cr&eacute;er une <strong>interface d'administration</strong> pour g&eacute;rer les produits de notre base de donn&eacute;es</li>
                    <li>mettre en place une <strong>interface de r&eacute;daction d'article</strong> pour permettre aux r&eacute;dacteurs d'&eacute;crire des articles consultable depuis le t&eacute;l&eacute;phone ou l'ordinateur gr&acirc;ce au site internet.</li>
                    <li>cr&eacute;er une <strong>marque</strong> permettant d'avoir une coh&eacute;rence graphique et linguistique dans la pr&eacute;sentation du produit et les diff&eacute;rents supports de communication</li>
                    <li>pouvoir lanc&eacute; l'application sur le <strong>PlayStore</strong> et <strong>l'Appstore</strong> afin de pouvoir partager l'application et voir les retours utilisateurs de notre application</li>
                    </ul>
                    <p>Nous avons travaill&eacute; sur le projet durant des s&eacute;ances d&eacute;di&eacute;es pr&eacute;vu par notre &eacute;cole pour mettre en oeuvre des projets &eacute;tudiants: ce sont 12 s&eacute;ances de 8 h r&eacute;parti sur toute l'ann&eacute;e nous permettant de mettre en place nos projets tout en les g&eacute;rant de A &agrave; Z.</p>
                    <p>Nous avons form&eacute; une &eacute;quipe compos&eacute; de:</p>
                    <ul>
                    <li>1 Chef de projet / Designer</li>
                    <li>1 D&eacute;veloppeur Back-end (Base de donn&eacute;es et API)</li>
                    <li>2 D&eacute;veloppeur Mobile/Web.</li>
                    <li>1 Responsable s&eacute;curit&eacute; et infrastructure</li>
                    </ul>
                    <p>Pour ma part, je me suis occup&eacute; de la gestion de l'&eacute;quipe ainsi que de la direction artistique pour ce projet, &eacute;tant une petite &eacute;quipe nous avons des t&acirc;ches diversifi&eacute;es, nous permettant de voir comment produire une application mobile et une marque pour la mettre en avant dans son ensemble.</p>
                    <h2>Gestion du projet</h2>
                    <p>Pour ce projet nous sommes partis sur la m&eacute;thodologie agile, nous permettant de diviser chaque s&eacute;ance en sprint, placer la communication au coeur du projet et mettre en avant la qualit&eacute; plus que la quantit&eacute;.</p>
                    <p>Nous avons mis en place une routine &agrave; chaque s&eacute;ance qui nous permet de cadrer chaque sprint et aborder tout les changements sur le projet.</p>
                    <img src="/img/article/Sprint_Planning.png" alt="">
                    <ol>
                    <li>La premi&egrave;re r&eacute;trospective permet &agrave; chaque membre de l'&eacute;quipe de ce rem&eacute;morer le travail qu'il &agrave; effectu&eacute; lors du sprint pr&eacute;c&eacute;dent et d'&eacute;voqu&eacute; les difficult&eacute;s qu'il a rencontr&eacute;.</li>
                    <li>Le point global permet &agrave; tout les membres de l'&eacute;quipe de visualiser o&ugrave; en est le projet par rapport aux objectifs et de se situ&eacute; sur l'avanc&eacute; du projet (proche de la fin ou non)</li>
                    <li>Le planning du sprint permet &agrave; chaque membre de voir les t&acirc;ches qui lui sont attribu&eacute;s pour le sprint et de voir si des changements sont &agrave; apport&eacute;s.</li>
                    <li>La retrospective de fin de sprint sert &agrave; mettre au clair tout ce qui &agrave; &eacute;t&eacute; produit permettant de prendre conscience de tout le travail effectu&eacute; et d'avoir une meilleur vision sur la suite du projet.</li>
                    </ol>
                    <p>Pour cr&eacute;er un espace d&eacute;di&eacute; au projet, nous avons eu besoin d'un logiciel permettant de faire de la gestion de t&acirc;ches, de la prise de note, de la documentation.</p>
                    <p>Apr&egrave;s des recherches et des tests de diff&eacute;rents logiciels de gestion de projet, nous sommes arriv&eacute;s sur Notion.</p>
                    <p>Notion, c'est une application (web, desktop et mobile) permettant de prendre des notes g&eacute;rer des t&acirc;ches avec diff&eacute;rentes vues (des listes, des kanbans, des timelines, des wikis, ...), il nous permet de centraliser les documents, faire un product backlog, une roadmap et g&eacute;rer les t&acirc;ches de mani&egrave;re claire et coh&eacute;rente &agrave; travers le projet.</p>
                    <img src="/img/article/Untitled.png" alt="">
                    <p>Sur chaque nous renseignons les informations suivantes:</p>
                    <ul>
                    <li>Le titre de la t&acirc;che</li>
                    <li>Sa cat&eacute;gorie</li>
                    <li>Qui travaille sur la t&acirc;che</li>
                    <li>Une description plus compl&egrave;te de la t&acirc;che</li>
                    <li>Une date/heure de d&eacute;but</li>
                    <li>Une case pour valid&eacute; la t&acirc;che une fois termin&eacute;</li>
                    <li>Une case pour dire qu'on travail dessus</li>
                    </ul>
                    <p>Nous avons aussi la possiblit&eacute; de voir toutes les t&acirc;ches faites sur l'ann&eacute;e ou de filtr&eacute; &agrave; un sprint sp&eacute;cifique gr&acirc;ce &agrave; la fonctionnalit&eacute; de filtre</p>
                    <img src="/img/article/Untitled (1).png" alt="">
                    <p>Nous avons commenc&eacute; par cr&eacute;e une roadmap qui est un document permettant de regrouper tout les parties importantes du projet, de les prioris&eacute;s et assign&eacute;s, ce document montre une vision globale sur toute l'ann&eacute;e et permet ainsi de pr&eacute;par&eacute; en amont ce qui est &agrave; faire en priorit&eacute;.</p>
                    <img src="/img/article/Untitled (2).png" alt="">
                    <p>Puis nous avons cr&eacute;e un product backlog permttant de faire le suivi, la priorisation des fonctionnalit&eacute;s de l'application et d&eacute;tailler chaque fonctionnalit&eacute; pour la centrer sur le besoin utilisateur.</p>
                    <p>On peut voir que le backlog contient des cartes ayant une indication de priorit&eacute;, la fonctionnalit&eacute; &agrave; laquelle elle est rattach&eacute; et elles sont rang&eacute;s selon 3 cat&eacute;gories: pas encore commenc&eacute;, en cours ou termin&eacute;. Cela permet d'avoir un suivi de l'avancement de l'application.</p>
                    <p>C'est carte contiennent une user story, avec une description qui d&eacute;fini le besoin utilisateur, une partie Tests d'acception pour d&eacute;finir sous quelles conditions la User Story est consider&eacute; comme compl&egrave;te et les T&acirc;ches regroupe les diff&eacute;rentes t&acirc;ches n&eacute;cessaire &agrave; la r&eacute;ussite de la User Story.</p>
                    <img src="/img/article/Untitled (3).png" alt="">
                    <p>Sur chaque s&eacute;ance dans l'ann&eacute;e nous avons fait un rapport afin d'avoir une vision plus d&eacute;taill&eacute; de ce qui c'est pass&eacute; lors de la s&eacute;ance, j'y note les activit&eacute;s qui ont &eacute;t&eacute; r&eacute;alis&eacute;s, les comp&eacute;tences acquises et utilis&eacute;s par les membres du groupe, les r&eacute;ussites et les difficult&eacute;s et solution.</p>
                    <img src="/img/article/Untitled (4).png" alt="">
                    <h2>D&eacute;roulement du projet</h2>
                    <p>&agrave; venir</p>
                    <h2>Lancement sur les store et r&eacute;seaux sociaux</h2>
                    <p>&agrave; venir</p>
                    <h2>Conclusion</h2>
                    <p>Ce projet nous as permis d'avoir une exp&eacute;rience sur la cr&eacute;ation d'un projet de A &agrave; Z, de la gestion de projet, de la conception de l'application et des logiciels administration, le d&eacute;veloppement des solutions, le d&eacute;ploiement ainsi que la mise en ligne des applications sur les Stores de Google et Apple. Nous avons mis cr&eacute;e une marque et fait de la communication autour de notre produit.</p>
                    <p>Ce projet m'a apport&eacute; beaucoup autant sur le plan technique avec les diff&eacute;rentes technologies utilis&eacute;&eacute;s que sur le gestion du projet avec la mise en place en concr&egrave;te du product backlog et de la roadmap, sur le management d'&eacute;quipe avec la gestion des diff&eacute;rents p&ocirc;les (marketing, d&eacute;veloppement, design, infrastructure).</p>
                    <p>Nous sommes fi&egrave;re d'avoir cr&eacute;e un projet comme celui-ci et d'avoir r&eacute;ussi &agrave; aller jusqu'au bout.</p>

                </div>
			</div>
		</main>
	</body>
</html>
