<!DOCTYPE html>
<html lang="fr">
	<head>
		<meta charset="utf-8" />
		<meta name="viewport" content="width=device-width, initial-scale=1" />
		<meta name="theme-color" content="#DCDCDC" />
		<!-- Primary Meta Tags -->
		<title>Portfolio - Jérémie Delécrin</title>
		<meta name="title" content="Tricycle App - Jérémie Delécrin" />
		<meta name="description" content="Portfolio: Jérémie Delécrin, développeur et designer. Consultez mes réalisations et mes compétences." />

		<!-- Open Graph / Facebook -->
		<meta property="og:type" content="website" />
		<meta property="og:url" content="https://jeremie-delecrin.netlify.app/" />
		<meta property="og:title" content="Portfolio - Jérémie Delécrin" />
		<meta property="og:description" content="Portfolio: Jérémie Delécrin, Front-End développeur. Consultez mes réalisations et mes compétences." />
		<meta property="og:image" content="img/logo-landscape.png" />

		<!-- Twitter -->
		<meta property="twitter:card" content="summary_large_image" />
		<meta property="twitter:url" content="https://jeremie-delecrin.netlify.app/" />
		<meta property="twitter:title" content="Portfolio - Jérémie Delécrin" />
		<meta property="twitter:description" content="Portfolio: Jérémie Delécrin, développeur et designer. Consultez mes réalisations et mes compétences." />
		<meta property="twitter:image" content="img/logo-landscape.png" />

		<link rel="icon" type="image/png" href="img/favicon.png" />
		<link rel="canonical" href="https://jeremie-delecrin.netlify.app/"">
		<link rel="stylesheet" type="text/css" href="style.css" />
		<link rel="stylesheet" type="text/css" href="article.css" />
		<script async defer data-website-id="81c58298-1a43-4c6e-a70a-7f260c16ebb2" src="https://analytics.app-tricycle.com/umami.js"></script>
        <link rel="preconnect" href="https://fonts.gstatic.com">
        <link href="https://fonts.googleapis.com/css2?family=Open+Sans:wght@400;600;700;800&display=swap" rel="stylesheet">
	</head>

	<body>
        <header class="article-header">
            <button class="back-home"><a href="/">Revenir sur le Portfolio</a></button>
            <p>Portfolio - Jérémie Delécrin</p>
        </header>
		<main class="article">
			<div class="article-container">
				<h1 class="article-title">Comment Tricycle App à été crée</h1>
				<div class="article-infos">
					<div class="article-date">26 avril 2021</div>
					<div class="article-author">
						<span class="article-author-label">Écrit par</span>
						<span class="article-author-name">Jérémie Delécrin</span>
					</div>
				</div>
				<div class="article-thumbnail">
					<img src="img/TricycleApp/1.png" alt="" />
				</div>
				<div class="article-content">
                    <h2>Tricycle App qu'est ce que c'est ?</h2>
                    <p>C'est une application mobile fait par un groupe de 5 jeunes &eacute;tudiants Nantais venant de Ynov Campus, ayant pour but d'aider n'importe qui &agrave; trier ses produits gr&acirc;ce &agrave; son smartphone et consulter des news positives sur l'environnement pour mettre en avant les bonnes actions faites &agrave; travers le monde.</p>
                    <p><img src="img/article/3features.png" alt="" /></p>
                    <p>L'application dispose avec 3 fonctionnalti&eacute;s principales:</p>
                    <ol>
                    <li>Le <strong>scan de produit</strong>: scannez le code barre du produit et l'application vous donnera les emplacements de tri correspondant &agrave; chaque emballage.</li>
                    <li>la <strong>recherche de produit</strong>: recherchez parmi les produits d&eacute;j&agrave; existant si le produit n'a pas de code barre.</li>
                    <li>la <strong>consultation d'article:</strong> nous proposons des articles positifs r&eacute;dig&eacute;s par nous-m&ecirc;me sur le th&egrave;me de l'environnement qui permet de valoriser les bonnes actions faites &agrave; travers le monde.</li>
                    </ol>
                    <p>Nous avons mis en ligne l'application sur le Google Playstore et l'Appstore d'Apple qui sont les canaux de t&eacute;l&eacute;chargements les plus r&eacute;pandus, qui permettront &agrave; un grand nombre de personne de pouvoir t&eacute;l&eacute;charger l'application.</p>
                    <p><a href="https://play.google.com/store/apps/details?id=com.tricycle.app">Tricycle App: scannez et recyclez ♻ - Apps on Google Play</a></p>
                    <p>&nbsp;</p>
                    <h2>Les d&eacute;buts de Tricycle App</h2>
                    <p>Tout d&eacute;bute par un besoin, celui de faciliter le tri des d&eacute;chets et de rendre cela accessible rapidement et facilement, une application mobile semble le support le plus adapt&eacute;, un objet du quotidien qu'on peut sortir de la poche facilement pour scanner son produit.</p>
                    <p>Nous avons travaill&eacute; sur le projet durant des s&eacute;ances d&eacute;di&eacute;es pr&eacute;vu par notre &eacute;cole pour mettre en oeuvre des projets &eacute;tudiants: ce sont 12 s&eacute;ances de 8 h r&eacute;parti sur toute l'ann&eacute;e nous permettant de mettre en place nos projets tout en les g&eacute;rant de A &agrave; Z.</p>
                    <p>Nous avons form&eacute; une &eacute;quipe compos&eacute; de:</p>
                    <ul>
                    <li>1 Chef de projet / Designer</li>
                    <li>1 D&eacute;veloppeur Back-end (Base de donn&eacute;es et API)</li>
                    <li>2 D&eacute;veloppeur Mobile/Web.</li>
                    <li>1 Responsable s&eacute;curit&eacute; et infrastructure</li>
                    </ul>
                    <p>Pour ma part, je me suis occup&eacute; de la gestion de l'&eacute;quipe ainsi que de la direction artistique pour ce projet, &eacute;tant une petite &eacute;quipe nous avons des t&acirc;ches diversifi&eacute;es, nous permettant de voir comment produire une application mobile et la faire conna&icirc;tre aupr&egrave;s du public gr&acirc;ce aux r&eacute;seaux sociaux et &agrave; l'image de marque.</p>
                    <p>J'ai commenc&eacute; par fixer les objectifs avec toute l'&eacute;quipe, pour pr&eacute;ciser la direction que nous souhaitons prendre sur le projet.</p>
                    <h2>Les objectifs</h2>
                    <p>Nous nous sommes fix&eacute;s des objectifs pour l'ann&eacute;e 2020 et l'ann&eacute;e 2021, nous permettant de fix&eacute;s les points importants du projet et mesurer notre avancement.</p>
                    <p>Nous avions comme objectif de:</p>
                    <ul>
                    <li>Cr&eacute;er le <strong>syst&egrave;me de scan</strong> des codes barres des produits et d'<strong>affichage des emplacements de tri</strong> selon leurs emballages</li>
                    <li>La <strong>recherche de produit</strong> gr&acirc;ce &agrave; leurs noms ou leurs appartenance &agrave; une cat&eacute;gorie.</li>
                    <li>Cr&eacute;ation des <strong>profils</strong> permettant de garder un historique des produits scann&eacute;es.</li>
                    <li>Mettre en place le <strong>syst&egrave;me de points,</strong> selon le produit on peut recevoir plus ou moins de points et en les accumulant on peut passer des niveaux et r&eacute;cup&eacute;rer des r&eacute;compenses.</li>
                    <li>Cr&eacute;ation d'une <strong>interface d'administration</strong> pour g&eacute;rer les produits de notre base de donn&eacute;es.</li>
                    <li>Mettre en place une <strong>interface de r&eacute;daction d'article</strong> pour permettre aux r&eacute;dacteurs d'&eacute;crire des articles consultable depuis le t&eacute;l&eacute;phone ou l'ordinateur gr&acirc;ce au site internet.</li>
                    <li>Cr&eacute;ation d'une <strong>marque</strong> permettant d'avoir une coh&eacute;rence graphique et linguistique dans la pr&eacute;sentation du produit et les diff&eacute;rents supports de communication.</li>
                    <li>Lancer l'application sur le <strong>PlayStore</strong> et <strong>l'Appstore</strong> afin de pouvoir partager l'application et voir les retours utilisateurs de notre application.</li>
                    </ul>
                    <h2>M&eacute;thodologie de gestion</h2>
                    <p>Pour ce projet nous sommes partis sur la m&eacute;thodologie agile, nous permettant de diviser chaque s&eacute;ance de l'ann&eacute;e en sprint, de placer la communication au coeur du projet, ce qui est tr&egrave;s important au sein d'une petit &eacute;quipe et nous permettant de mettre en avant la qualit&eacute; plus que la quantit&eacute; en prenant le temps de faire nos t&acirc;ches et ainsi &eacute;viter de passer du temps sur la partie de correction de bugs..</p>
                    <p>Nous avons une routine &agrave; chaque s&eacute;ance qui nous permet de cadrer chaque sprint et aborder tout les changements sur le projet et permettre &agrave; toute l'&eacute;quipe d'&ecirc;tre au courant de l'avancement globale du projet et pouvoir mieux s'organiser selon la situation au moment du sprint.</p>
                    <p><img src="img/article/Sprint_Planning.png" alt="" /></p>
                    <p>Moments cl&eacute;s d'un sprint</p>
                    <ol>
                    <li>La <strong>premi&egrave;re r&eacute;trospective</strong> permet &agrave; chaque membre de l'&eacute;quipe de ce rem&eacute;morer le travail qu'il &agrave; effectu&eacute; lors du sprint pr&eacute;c&eacute;dent et d'&eacute;voqu&eacute; les difficult&eacute;s qu'il a rencontr&eacute;.</li>
                    <li>Le <strong>point global</strong> permet &agrave; tout les membres de l'&eacute;quipe de visualiser o&ugrave; en est le projet par rapport aux objectifs et de se situer sur l'avanc&eacute; du projet (proche de la fin ou non)</li>
                    <li>Le <strong>planning du sprint</strong> permet &agrave; chaque membre de voir les t&acirc;ches qui lui sont attribu&eacute;es pour le sprint et de voir si des changements sont &agrave; apport&eacute;s.</li>
                    <li>La <strong>retrospective</strong> de fin de sprint sert &agrave; r&eacute;capitul&eacute; tout ce qui &agrave; &eacute;t&eacute; produit permettant de prendre conscience de tout le travail effectu&eacute; et d'avoir une meilleur vision sur la suite du projet.</li>
                    </ol>
                    <p>Pour chaque sprint nous r&eacute;digeons un rapport afin d'avoir un historique exact de ce qu'il s'est pass&eacute; pr&eacute;cisement pendant ce sprint, j'y note les activit&eacute;s qui ont &eacute;t&eacute; r&eacute;alis&eacute;s, les comp&eacute;tences acquises et utilis&eacute;s par les membres du groupe, les r&eacute;ussites et les difficult&eacute;s et solution.</p>
                    <p><img src="img/article/rapport.png" alt="" /></p>
                    <h2>Gestion des t&acirc;ches et documents</h2>
                    <p>Nous avons besoin d'un espace d&eacute;di&eacute; au projet qui permet de centraliser tout nos documents, g&eacute;rer nos t&acirc;ches, nos prises de notes et d'acc&eacute;der rapidement &agrave; toutes les informations concernant le projet.</p>
                    <p>Apr&egrave;s des recherches et des tests de diff&eacute;rents logiciels de gestion de projet, nous sommes arriv&eacute;s sur un logiciel que nous avons trouv&eacute; tr&egrave;s complet et r&eacute;pondait parfaitement &agrave; nos besoins, il s'appelle Notion.</p>
                    <p><a href="https://notion.so">Notion - The all-in-one workspace for your notes, tasks, wikis, and databases.</a></p>
                    <p>Notion, c'est une application (web, desktop et mobile) permettant de prendre des notes, g&eacute;rer des listes avec diff&eacute;rentes vues (des listes, des kanbans, des timelines, des wikis, ...) ou encore des galleries, il nous permet de centraliser les documents, faire un product backlog, une roadmap et g&eacute;rer les t&acirc;ches de mani&egrave;re claire et coh&eacute;rente &agrave; travers le projet et de travailler &agrave; plusieurs en temps r&eacute;el sur tout nos documents.</p>
                    <p><img src="img/article/tasks.png" alt="" /></p>
                    <p>Gestion des t&acirc;ches dans Notion</p>
                    <p>Nous avons aussi la possiblit&eacute; de voir toutes les t&acirc;ches faites sur l'ann&eacute;e ou de filtr&eacute; &agrave; un sprint sp&eacute;cifique gr&acirc;ce &agrave; la fonctionnalit&eacute; de filtre</p>
                    <p><img src="img/article/filter.png" alt="" /></p>
                    <p>Filtre des t&acirc;ches par s&eacute;ances</p>
                    <h2>D&eacute;roulement du projet</h2>
                    <p>A travers cette partie, vous allez voir les grandes lignes du d&eacute;roulement de notre projet depuis sa cr&eacute;ation jusqu'&agrave; son lancement.</p>
                    <p>Quand on commence un projet, on s'attaque d'abord &agrave; la partie conception o&ugrave; nous &eacute;tablissons les besoins et objectifs du projet, pendant cette phase nous avons cr&eacute;e de nombreux documents comme le cahier des charges, les sch&eacute;ma de base de donn&eacute;es et de cas d'utilisations, les wireframes de l'application, etc...</p>
                    <p><img src="img/article/tricycleapp-documents.png" alt="" /></p>
                    <p>Nous devions aussi trouv&eacute; les technologies adapt&eacute;s &agrave; notre projet et nos comp&eacute;tences, nous n'avions eu que peu d'exp&eacute;rience dans le d&eacute;veloppement d'application mobile, il a donc &eacute;t&eacute; important de bien se renseigner puis de passer par une &eacute;tape de formation afin de ma&icirc;triser la technologie utilis&eacute;s.</p>
                    <p><img src="img/article/Technologie.png" alt="" /></p>
                    <p>Nous avons utilis&eacute; la technologie Nativescript sur notre projet afin de conserver une performance optimale gr&acirc;ce aux composants natif.</p>
                    <p>Pour commencer j'ai cr&eacute;e une <strong>roadmap</strong> qui est un document permettant de regrouper toutes les parties importantes du projet, de les prioris&eacute;es et assign&eacute;es, ce document montre une vision globale sur toute l'ann&eacute;e et permet ainsi de pr&eacute;parer en amont ce qui est &agrave; faire en priorit&eacute;.</p>
                    <p><img src="img/article/roadmap.png" alt="" /></p>
                    <p>Une partie de la Roadmap</p>
                    <p>Puis j'ai cr&eacute;e un product backlog permettant de faire le suivi et la priorisation des fonctionnalit&eacute;s de l'application et d&eacute;tailler le besoin utilisateur.</p>
                    <p><img src="img/article/product-bcklog.png" alt="" /></p>
                    <p>Product Backlog de l'application mobile</p>
                    <p>On peut voir que le product backlog contient des cartes ayant les indications suivantes:</p>
                    <ul>
                    <li>le nom de la User Story</li>
                    <li>une indication de priorit&eacute;</li>
                    <li>la fonctionnalit&eacute; &agrave; laquelle elle est rattach&eacute;</li>
                    </ul>
                    <p>Chaque User Story est plac&eacute; dans une cat&eacute;gorie qui d&eacute;fini son statut, les trois cat&eacute;gories sont: pas encore commenc&eacute;, en cours ou termin&eacute;.</p>
                    <p>Cette gestion des User Story permet d'avoir un suivi de l'avancement de l'application, tout en gardant un niveau de qualit&eacute; en pensant au besoin utilisateur. Je d&eacute;fini bien en amont les besoins afin que les d&eacute;veloppeurs sachent exactement la marche &agrave; suivre et puisse voir comment un utilisateur naviguera sur l'application.</p>
                    <p>Chaque carte ou User Story peu &ecirc;tre ouverte pour avoir plus de d&eacute;tail, on y retrouve:</p>
                    <ul>
                    <li>une description qui d&eacute;fini le besoin utilisateur.</li>
                    <li>une partie "Tests d'acception" pour d&eacute;finir sous quelles conditions la User Story est consider&eacute; comme compl&egrave;te.</li>
                    <li>les "T&acirc;ches" regroupe les diff&eacute;rentes t&acirc;ches n&eacute;cessaire &agrave; la r&eacute;ussite de la User Story.</li>
                    </ul>
                    <p><img src="img/article/user-story.png" alt="" /></p>
                    <p>Carte dans le product backlog</p>
                    <p>Les t&acirc;ches elles sont r&eacute;pertori&eacute;s dans un autre endroit, &eacute;tant donn&eacute; qu'elles sont nombreuses et pars toujours en relation avec le product backlog.</p>
                    <p>Cette affichage de t&acirc;ches me permet d'avoir une vision globale et de g&eacute;rer mon &eacute;quipe plus facilement car tout est au m&ecirc;me endroit, elle permet aussi &agrave; chacun de voir ce que font les autres pour conna&icirc;tre un peu la situation et savoir &agrave; qui demander si ils ont des questions.</p>
                    <p><img src="img/article/tasks.png" alt=""/></p>
                    <p>Gestion des t&acirc;ches dans Notion</p>
                    <p>Sur chaque nous renseignons les informations suivantes:</p>
                    <ul>
                    <li>Le titre de la t&acirc;che</li>
                    <li>Sa cat&eacute;gorie: le sujet de la t&acirc;che (d&eacute;veloppement, marketing, design, gestion de projet)</li>
                    <li>Qui travaille sur la t&acirc;che</li>
                    <li>Une description plus compl&egrave;te de la t&acirc;che</li>
                    <li>Une date/heure de d&eacute;but</li>
                    <li>Une case pour valid&eacute; la t&acirc;che une fois termin&eacute;</li>
                    <li>Une case pour dire qu'on travail dessus</li>
                    </ul>
                    <p>Une fois la phase de r&eacute;flexion et conception termin&eacute;, nous avons commenc&eacute; &agrave; d&eacute;velopper le projet avec comme partie importante:</p>
                    <ul>
                    <li><strong>L'application mobile</strong>: coeur du projet, les utilisateurs passeront plus de temps sur l'application et pourront y g&eacute;rer tout ce qui concerne leur compte et leur activit&eacute;.</li>
                    <li><strong>L'administraion de produit</strong>: une interface destin&eacute;e aux administrateurs permettant de cr&eacute;er et modifier les informations des produits.</li>
                    <li><strong>L'outil de r&eacute;daction d'article</strong>: une interface permettant aux r&eacute;dacteurs de r&eacute;diger leurs articles et de les mettre directement en ligne une fois r&eacute;dig&eacute;.</li>
                    <li>Le <strong>serveur</strong>: permet de g&eacute;rer la communication entre les donn&eacute;es et l'application de mani&egrave;re s&eacute;curis&eacute; et g&eacute;rer les diff&eacute;rentes actions sur l'application et sur l'adminsitration des produits (inscription, cr&eacute;ation de produit)</li>
                    <li>La <strong>base de donn&eacute;es</strong>: contient les informations des produits ainsi que les donn&eacute;es utilisateurs qui y sont s&eacute;curis&eacute;es.</li>
                    </ul>
                    <p>Nous avons prioris&eacute; le d&eacute;veloppement de chacun des solutions, l'application et le serveur &eacute;tant ce qu'il fallait d&eacute;velopp&eacute; en premier.</p>
                    <p>Le d&eacute;veloppement de l'application s'est fait en suivant la priorisation faite dans le product backlog, nous permettant de correspondre au besoin utilisateur tout en ayant une vision d&eacute;taill&eacute; de notre avancement.</p>
                    <p>Le serveur et la base de donn&eacute;es ont besoin d'&ecirc;tre accessible depuis internet afin que toutes personnes avec l'application puisse &eacute;changer des informations. Un des membres du projet est en charge du serveur et de sa s&eacute;curisation, il a mis en place de nombreuses barri&egrave;res afin d'&eacute;viter les potentielles attaques et assurer la s&eacute;curit&eacute; des donn&eacute;es.</p>
                    <p>Ensuite nous avons cr&eacute;e une interface d'administration des produits, nous permettant de modifier les informations d'un produit comme son nom, sa cat&eacute;gorie ou encore les emballages qu'il poss&egrave;dent.</p>
                    <p><img src="img/article/adminproduct.png" alt="" /></p>
                    <p>Ensuite nous avons cr&eacute;e une interface pour g&eacute;rer la r&eacute;daction des articles.</p>
                    <p><img src="img/article/interface-redac.png" alt="" /></p>
                    <p>Pour la partie design et marketing il nous fallais cr&eacute;e une marque afin de garder une coh&eacute;rence visuelle et de communication sur tout nos supports. Pour cela j'ai r&eacute;fl&eacute;chi &agrave; l'identit&eacute; visuelle ce qui impacte le design de l'application mobile et du site internet.</p>
                    <p>L'identit&eacute; viuelle est bas&eacute; sur la positvit&eacute; et la facilit&eacute;, le projet tourne autour de ces 2 valeurs.</p>
                    <h2>Lancement du projet</h2>
                    <p>Une fois la premi&egrave;re version de l'application d&eacute;velopp&eacute; nous pouvons la mettre en ligne afin que n'importe qui puisse la t&eacute;l&eacute;charger Et par la m&ecirc;me occasion nous avons commenc&eacute; &agrave; mettre en avant notre application gr&acirc;ce aux r&eacute;seaux sociaux.</p>
                    <p>La mise en ligne de l'application se fait sur les 2 stores les plus utilis&eacute;s du march&eacute;, Le Google Play Store pour les t&eacute;l&eacute;phones Android et L'Appstore d'Apple pour les t&eacute;l&eacute;phones iOS.</p>
                    <p>Tout d'abord pour chacun des stores il faut se cr&eacute;er un compte et payer une certaine somme afin de pouvoir soumettre son application, pour le Play Store, nou avons payer 24&euro; ce qui nous permet de pouvoir soumettre &agrave; vie nos applications sur le PlayStore, tandis que sur l'Appstore le prix est de 100&euro; pour une ann&eacute;e.</p>
                    <p>Une fois le compte cr&eacute;e et la somme pay&eacute;, nous avons remplis la fiche de pr&eacute;sentation (ce que verront les utilisateurs) et r&eacute;pondu &agrave; des questionnaires afin que les stores v&eacute;rifie que notre application respecte bien les r&egrave;gles (&acirc;ge, contenu, donn&eacute;es personelle partag&eacute;es, etc...), &agrave; not&eacute; que nous devons obligatoirement avoir un site internet permettant de donner un lien vers les pages de politique de confidentialit&eacute; et de Conditions d'utilisation.</p>
                    <p>Une fois toute ces &eacute;tapes termin&eacute;, nous avons soumis l'application et au bout de 6 jours environ notre application &agrave; &eacute;t&eacute; valid&eacute; sur les 2 stores.</p>
                    <p><img src="img/article/store.png" alt="" /></p>
                    <p>Les mise &agrave; jours de notre application quant &agrave; elle n'ont besoin que de 1 journ&eacute;e pour &ecirc;tre valid&eacute;.</p>
                    <p>L'application est lanc&eacute;, il est temps de la mettre en avant et pour cela nous avons &eacute;tudier la cible de notre application pour savoir quelles canaux seront les plus pertinent pour metttre en avant notre application et nos articles.</p>
                    <p>Nous avons choisi les r&eacute;seaux sociaux Twitter et Instagram, qui sont des r&eacute;seaux avec des utilisateurs assez jeunes.</p>
                    <p>Etant donn&eacute; que nous avons cr&eacute;e une marque il faut quelle soit coh&eacute;rente dans sa communication a travers les diff&eacute;rents canaux, pour cela nous avons cr&eacute;e un document qui d&eacute;crit et uniformise la mani&egrave;re de communiquer sur nos articles ainsi que nos r&eacute;seaux sociaux.</p>
                    <h2>Conclusion</h2>
                    <p>Ce projet nous as permis d'avoir une exp&eacute;rience sur la cr&eacute;ation d'un projet de A &agrave; Z, de la gestion de projet, de la conception de l'application et des logiciels administration, le d&eacute;veloppement des solutions, le d&eacute;ploiement ainsi que la mise en ligne des applications sur les Stores de Google et Apple. Nous avons mis cr&eacute;e une marque et fait de la communication autour de notre produit.</p>
                    <p>Ce projet m'a apport&eacute; beaucoup autant sur le plan technique avec les diff&eacute;rentes technologies utilis&eacute;&eacute;s que sur le gestion du projet avec la mise en place en concr&egrave;te du product backlog et de la roadmap, sur le management d'&eacute;quipe avec la gestion des diff&eacute;rents p&ocirc;les (marketing, d&eacute;veloppement, design, infrastructure).</p>
                    <p>Nous sommes fi&egrave;re d'avoir cr&eacute;e un projet comme celui-ci et d'avoir r&eacute;ussi &agrave; aller jusqu'au bout.</p>
                </div>
			</div>
		</main>
	</body>
</html>
